Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/УсловияТруда/УсловияТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УсловияТруда</name>
  <basedOn>Catalog.Должности</basedOn>
  <basedOn>Catalog.УсловияТруда</basedOn>
  <predefined>
    <items>
      <name>НормальныеУсловия</name>
      <description>Нормальные условия</description>
    </items>
  </predefined>
  <attributes>
    <name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
    <type>
      <types>EnumRef.ВидыРаботСДосрочнойПенсией</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДосрочногоНазначенияПенсии</name>
    <type>
      <types>CatalogRef.ОснованияДосрочногоНазначенияПенсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияТрудаПФР</name>
    <type>
      <types>CatalogRef.ОсобыеУсловияТрудаПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадбавкиЗаВредность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиваетсяНадбавкаЗаВредность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительногоОтпускаВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПозицииСпискаПФР</name>
    <type>
      <types>CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/УсловияТруда/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Должности")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УсловияТруда") Тогда
		
		ИменаРеквизитов = "ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,ОснованиеДосрочногоНазначенияПенсии,ОсобыеУсловияТрудаПФР,ПроцентНадбавкиЗаВредность,ВыплачиваетсяНадбавкаЗаВредность,КоличествоДнейДополнительногоОтпускаВГод,КодПозицииСпискаПФР";
		
		СведенияОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОснования);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
